anthropic.claude-code
docker.docker
esbenp.prettier-vscode
github.copilot-chat
github.vscode-github-actions
golang.go
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-vscode-remote.remote-containers
ms-vscode.cmake-tools
ms-vscode.cpp-devtools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.makefile-tools
rust-lang.rust-analyzer
vscodevim.vim
ziglang.vscode-zig
